rails_forms_ctm/app/controllers/blog_controller.rb

INSERT INTO "blogs" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Second Post wth"], ["content", "how did this work?"], ["created_at", "2020-08-04 21:51:15.419358"], ["updated_at", "2020-08-04 21:51:15.419358"]]
---
    def create
        @blog = Blog.create(
            title:params[:title],
            content:params[:content])

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def update
        @blog = Blog.find(params[:id])

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 5]]
---
    def delete
        @blog = Blog.find(params[:id])
        if @blog.destroy